vms/sysbench/sysbench_disk_rndrd.txt
admin@master:~$   mpirun -x LD_LIBRARY_PATH --bind-to core -np 2 --map-by ppr:1:core --hostfile hosts.txt sysbench fileio --threads=2 --file-test-mode=rndrd run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!

sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      6369.37
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  99.52
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              63703

Latency (ms):
         min:                                    0.00
         avg:                                    0.31
         max:                                    6.12
         95th percentile:                        0.94
         sum:                                19963.41

Threads fairness:
    events (avg/stddev):           31851.5000/46.50
    execution time (avg/stddev):   9.9817/0.00


File operations:
    reads/s:                      6393.21
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  99.89
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0006s
    total number of events:              63942

Latency (ms):
         min:                                    0.00
         avg:                                    0.30
         max:                                   34.88
         95th percentile:                        1.82
         sum:                                19254.16

Threads fairness:
    events (avg/stddev):           31971.0000/32.00
    execution time (avg/stddev):   9.6271/0.14