vms/sysbench/sysbench_disk_seqrd.txt
admin@master:~$ mpirun -x LD_LIBRARY_PATH --bind-to core -np 2 --map-by ppr:1:core --hostfile hosts.txt sysbench fileio --threads=2 --file-test-mode=rndrw run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!

Initializing worker threads...

Threads started!


File operations:
    reads/s:                      123.06
    writes/s:                     82.04
    fsyncs/s:                     276.62

Throughput:
    read, MiB/s:                  1.92
    written, MiB/s:               1.28

General statistics:
    total time:                          11.2131s
    total number of events:              5146

Latency (ms):
         min:                                    0.00
         avg:                                    3.88
         max:                                  194.77
         95th percentile:                       15.00
         sum:                                19987.84

Threads fairness:
    events (avg/stddev):           2573.0000/20.00
    execution time (avg/stddev):   9.9939/0.00


File operations:
    reads/s:                      128.41
    writes/s:                     85.61
    fsyncs/s:                     289.01

Throughput:
    read, MiB/s:                  2.01
    written, MiB/s:               1.34

General statistics:
    total time:                          11.2133s
    total number of events:              5385

Latency (ms):
         min:                                    0.00
         avg:                                    3.72
         max:                                  193.84
         95th percentile:                       15.55
         sum:                                20010.02

Threads fairness:
    events (avg/stddev):           2692.5000/5.50
    execution time (avg/stddev):   10.0050/0.00